app/controllers/formations_controller.rb

  def index
    @formations = Formation.all
---
SELECT "formations".* FROM "formations"

    def set_formation
      @formation = Formation.find(params[:id])
---
SELECT  "formations".* FROM "formations" WHERE "formations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]