app/models/user.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-03-03 14:13:43.824012"], ["updated_at", "2020-03-03 14:13:43.824012"]]
---
  def create_cart
    Cart.create!(user_id: self.id)